# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'antigen' # Plugin manager for zsh
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gatsby-cli'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'netlify-cli'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'starship'
brew 'stripe/stripe-cli/stripe'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.1'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
# brew 'nginx'
brew 'node'
brew 'nvm'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask '1password-cli'
cask 'amethyst'
cask 'basecamp'
cask 'brave-browser'
cask 'dbngin'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'gpg-suite'
cask 'helo'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'keka'
cask 'loom'
cask 'monitorcontrol'
cask 'phpmon'
cask 'phpstorm'
cask 'postman'
cask 'ray'
cask 'raycast'
cask 'setapp'
cask 'sketch'
cask 'skitch'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'sublime-merge'
cask 'spectacle'
cask 'telegram'
cask 'tinkerwell'
cask 'transmission'
cask 'twitter'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-fira-code'
cask 'font-roboto'
